In [1]:
import pandas as pd
import numpy as np
import random

1. ¿Qué diferencia hay entre una Serie y un DataFrame?

Una serie es unidimensional y los Dataframes son de dos dimensiones.

2. Crea dos listas:

- Una que se llame "valores" que tenga 7 números aleatorios.
- Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [2]:
# Creamos una lista usando el metodo random.sample
valores = random.sample(range(1,50),7)
valores

[49, 30, 5, 41, 15, 21, 24]

In [3]:
# Creamos una lista para los índices con los días de la semana
indices = ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]
indices

['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado', 'domingo']

A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [5]:
# Creamos una Serie con las dos listas
serie1 = pd.Series(valores,indices)
serie1

lunes        49
martes       30
miercoles     5
jueves       41
viernes      15
sabado       21
domingo      24
dtype: int64

A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.

In [7]:
# Creamos un diccionario con las dos listas mediante un bucle for
dict1 = {}
for a,b in zip(indices,valores):
    dict1[a] = b
dict1

{'lunes': 49,
 'martes': 30,
 'miercoles': 5,
 'jueves': 41,
 'viernes': 15,
 'sabado': 21,
 'domingo': 24}

In [8]:
# Creamos una Serie con el diccionario creado anteriormente
serie2 = pd.Series(dict1)
serie2

lunes        49
martes       30
miercoles     5
jueves       41
viernes      15
sabado       21
domingo      24
dtype: int64

In [9]:
# Que forma tiene esta ultima serie?
serie2.shape

(7,)

In [10]:
# Que tipo de datos tiene?
serie2.dtypes

dtype('int64')

In [11]:
# Que tamaño tiene?
serie2.size

7

In [12]:
# Cuales son los índices de la serie?
serie2.index

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

In [13]:
# Cuales son los values de la serie?
serie2.values

array([49, 30,  5, 41, 15, 21, 24])

In [15]:
# Recordamos los valores de serie2
serie2

lunes        49
martes       30
miercoles     5
jueves       41
viernes      15
sabado       21
domingo      24
dtype: int64

In [17]:
# Extraed el valor para el índice lunes
serie2["lunes"]

49

In [18]:
# Extraed el valor para el índice lunes, martes, miercoles
serie2["lunes":"miercoles"]

lunes        49
martes       30
miercoles     5
dtype: int64

In [23]:
# Extraed el valor para el índices lunes y domingo
serie2[[0,6]]

lunes      49
domingo    24
dtype: int64

3. Es el turno de los DataFrames
- Cread un array de dos dimensiones con 4 filas y 3 columnas.
- Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".
- Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:

In [26]:
# Creamos un array de 2 dimensiones con 4 filas y 3 columnas
array1 = np.random.randint(0,50, (4,3))
array1

array([[47, 17, 37],
       [16, 46, 33],
       [42, 21, 22],
       [11, 31, 22]])

In [27]:
# Convertir el array en un dataframe
df1 = pd.DataFrame(array1, columns= ["España", "Francia", "Italia"])
df1

   España  Francia  Italia
0      47       17      37
1      16       46      33
2      42       21      22
3      11       31      22

In [29]:
# Cargad el DataFrame medallas.csv
df2 = pd.read_csv("files/medallas.csv", index_col=["País"])
df2

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [34]:
# Usando el loc extraed todas las columnas de la fila "Tailandia"
df2.loc["Tailandia",]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

In [35]:
# Usando el loc extraed todas las columnas de China e Irán.
df2.loc[["China","Irán"],]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [37]:
# Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.
df2.loc[["China","Irán"],["Oro","Plata","Bronce"]]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [38]:
# Usando el iloc extraed la información de la India. Devolved todas las columnas.
df2.iloc[5,]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [42]:
# Usando el iloc extraed todas las columnas de los paises que estén en posición impar (posición de Python, no humana). 
# La primera que nos tendría que salir es Japón y la última Corea del Norte.
df2.iloc[1::2,]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [49]:
# Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".
df2.iloc[1::2,1:4]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

In [50]:
# ¿Qué país consiguió más de 200 medallas de oro?
df2[df2.Oro > 200]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [51]:
# ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
df2[(df2.Oro > 200) & (df2.Plata > 1000)]

       Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

In [52]:
# ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?
df2[(df2.Oro > 200) | (df2.Bronce > 700)]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [58]:
# Recordamos el dataframe
df2

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [60]:
# Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.
df2 = df2.drop(columns=["Unnamed: 0"])
df2

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

In [61]:
# Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.
df2 = df2.assign(Total=df2["Oro"]+df2["Bronce"]+df2["Plata"])
df2

                  Oro  Plata  Bronce  Total
País
China            1473    994     720   3187
Japón            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Irán              179    181     197    557
Kazajistán        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taipéi       99    144     276    519
Corea del Norte    91    120     235    446